In [2]:
import pandas as pd
import numpy as np

In [3]:
dataframe = pd.DataFrame

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
panda_series = pd.Series(np.array([4,8,15,16,23,42]))

In [5]:
panda_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
data_list = [1,2,3,4,"shubham", "khera", 1.56, 90, "test", "Data Science"]
series = np.array(data_list)
pd_ser = pd.Series(series)
print(pd_ser)

0               1
1               2
2               3
3               4
4         shubham
5           khera
6            1.56
7              90
8            test
9    Data Science
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data:

<img src = "1.jpg"/>

##### Then, print the DataFrame.

In [7]:
data = {"Name": ["Alice", "Bob", "Claire"], "Age" : [25, 30, 27], "Gender" : ["Female", "Male", "Female"]}
dataframe = pd.DataFrame(data)

In [8]:
dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

<h4> In pandas, a DataFrame is a two-dimensional, tabular data structure that is widely used for data manipulation and analysis. It is essentially a container for storing and working with labeled data in rows and columns. Each column in a DataFrame is a pandas Series. </h4>

In [9]:
# Creating a DataFrame
data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 27],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df1 = pd.DataFrame(data1)

# Displaying the DataFrame
print("DataFrame:")
print(df1)
print("\nDataFrame Columns:")
print(df1.columns)

# Accessing a specific column as a Series
age_series = df1['Age']

# Displaying the Series
print("\nSeries (Age column):")
print(age_series)

DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   27    Los Angeles

DataFrame Columns:
Index(['Name', 'Age', 'City'], dtype='object')

Series (Age column):
0    25
1    30
2    27
Name: Age, dtype: int64

- In this example, we create a DataFrame named df with three columns: 'Name', 'Age', and 'City'. Each column in the DataFrame is a Series. We then access the 'Age' column as a separate Series (age_series). The key distinction is that the DataFrame is a 2D structure, while a Series is a 1D structure representing a single column.

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides a rich set of functions for manipulating and analyzing data in a DataFrame. Here are some common functions:

#### 1. head() and tail(): Display the first or last n rows of the DataFrame.

In [10]:
df1.head(1)

    Name  Age      City
0  Alice   25  New York

In [11]:
df1.tail(1)

      Name  Age         City
2  Charlie   27  Los Angeles

#### 2. info(): Display a concise summary of the DataFrame, including data types, non-null counts, and memory usage.

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

#### 3. describe(): Generate descriptive statistics (count, mean, std deviation, min, 25%, 50%, 75%, max) of numerical columns.

In [13]:
df1.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

#### 4. shape: Return the dimensions (rows, columns) of the DataFrame.

In [14]:
df1.shape

(3, 3)

#### 5. columns and index: Access the column names and index of the DataFrame.

In [15]:
df1.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [16]:
df1.index

RangeIndex(start=0, stop=3, step=1)

#### 6. loc[] and iloc[]: Access a group of rows and columns by labels (loc[]) or integer-based indexing (iloc[]).

In [17]:
df1.loc[1:3, ['Name', 'Age']]

      Name  Age
1      Bob   30
2  Charlie   27

In [24]:
df1.iloc[1:2]

  Name  Age           City
1  Bob   30  San Francisco

#### 7. sort_values(): Sort the DataFrame by one or more columns.

In [25]:
df1.sort_values(by='Age', ascending=False)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   27    Los Angeles
0    Alice   25       New York

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

- Series and DataFrame are mutable, meaning their contents can be modified after creation.
- Panel is deprecated, and it's recommended to use other structures for handling three-dimensional data.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 22])
gender = pd.Series(["Female", "Male", "Female"])
cities = pd.Series(['New York', 'San Francisco', 'Los Angeles'])

# Creating a DataFrame using the Series
data = {'Name': names, 'Age': ages, 'Gender': gender, 'City': cities}
df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)

      Name  Age  Gender           City
0    Alice   25  Female       New York
1      Bob   30    Male  San Francisco
2  Charlie   22  Female    Los Angeles

#### In this example, four Series (names, ages, gender and cities) are created, each representing a column of the DataFrame. The Series are then combined into a dictionary (data), where keys are the column names ('Name', 'Age', 'Gender', 'City') and values are the corresponding Series. Finally, a DataFrame (df) is created using this dictionary. The resulting DataFrame has columns 'Name', 'Age', 'Gender' and 'City', with each column populated by the values from the respective Series.